In [1]:
import pandas as pd
from pandas import DataFrame, Series
s = Series([1, 2, 3, 4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [2]:
b = Series(['Hamza' , 'Ahmed' , "Laiba" , "Fatima" , 'Nasir' , 'Khani'])
b

0     Hamza
1     Ahmed
2     Laiba
3    Fatima
4     Nasir
5     Khani
dtype: object

In [4]:
c = Series(['Shahzad' , 'Ahmed' , "Laiba" , "Fatima" , 'Umer' , 'Khani'])
c

0    Shahzad
1      Ahmed
2      Laiba
3     Fatima
4       Umer
5      Khani
dtype: object

In [6]:
c1 = Series(c.values , index = ['S','A','L','F','A','K'])
c1

S    Shahzad
A      Ahmed
L      Laiba
F     Fatima
A       Umer
K      Khani
dtype: object

In [7]:
c1['A']

A    Ahmed
A     Umer
dtype: object

In [ ]:
a = Series(s.values , index = ['a', 'b', 'c' , 'd'])
a

In [ ]:
d = Series(['ab' , 'cd' , 'ef' , 'gh'], index = a.index)
d

In [10]:
dates = pd.date_range('2019-07-01', '2019-07-07')
dates

DatetimeIndex(['2019-07-01', '2019-07-02', '2019-07-03', '2019-07-04',
               '2019-07-05', '2019-07-06', '2019-07-07'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
b = Series([80, 82, 85, 90,83, 87,90],index = dates)
b

In [ ]:
b.mean()

In [ ]:
b2 = Series([70, 75, 69, 83, 79, 77,87],index =dates)
b2

In [ ]:
b3 = Series(3, index=dates)
b3

In [ ]:
b2['2019-07-01':'2019-07-05']

In [ ]:
result = DataFrame({'Midterm': [32,76,98,99,67],'Finals':[45,56,76,87,89]},index=[1,2,3,4,5])
result

In [ ]:
result = DataFrame({'Midterm': b ,'Finals':b2},index=[12,23,34,45,56,67,78])
result

In [ ]:
result = DataFrame({'Midterm': b ,'Finals':b2,})
result

In [ ]:
result['differ']=[45,67,87,98,99,99,90]
result

In [ ]:
diff = result.Midterm - result.Finals
diff

In [ ]:
mult = result.Midterm * result.Finals
mult

In [ ]:
result['Difference']=diff
result

In [ ]:
new = DataFrame({'Midterm': b,'Finals': b2 , 'difference': diff , 'Multiply': mult})
new

In [ ]:
new.columns

In [ ]:
new.difference['2019-07-02':"2019-07-06"]

In [ ]:
new.iloc[6]

In [ ]:
new.loc['2019-07-03']

In [ ]:
new.iloc[[1, 3, 5]].difference

In [ ]:
new.iloc[[2,4,0]].Midterm

In [ ]:
new.Finals[new.Finals>75]

In [ ]:
new.Midterm[new.Midterm>78]

In [ ]:
new.loc['2019-07-04': '2019-07-06']

In [ ]:
new.Midterm > 82

In [ ]:
new[new.Midterm > 82]

In [ ]:
obj = pd.Series([4, 7, -5, 3 , 4, 7, 6],index = pd.RangeIndex(start = 0 , stop = 14 , step = 2))
obj.values

In [ ]:
obj.index

In [ ]:
obj1 = pd.Series([4, 7, -5, 6],index = ['a' , 'b' , 'c' ,'d'])
obj1.values

In [ ]:
obj1['e'] = 34

In [65]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
sdata

{'Ohio': 35000, 'Oregon': 16000, 'Texas': 71000, 'Utah': 5000}

In [66]:
states = ['California', 'Ohio', 'Oregon', 'Utah', 'Texas']
states

['California', 'Ohio', 'Oregon', 'Utah', 'Texas']

In [73]:
obj4 = pd.Series(sdata, index=states)
obj4[['Ohio','Texas']]

Ohio     35000.0
Texas    71000.0
dtype: float64

In [42]:
import numpy as np
np.random.seed(1)
pd.Series(np.random.randn(5))

0    1.624345
1   -0.611756
2   -0.528172
3   -1.072969
4    0.865408
dtype: float64

In [47]:
pd.Series(np.linspace(10, 100, 10))

0     10.0
1     20.0
2     30.0
3     40.0
4     50.0
5     60.0
6     70.0
7     80.0
8     90.0
9    100.0
dtype: float64

In [57]:
dict1 = {'a':1 , 'b':2 , 'c':3 , 'd':4}

In [75]:
s = Series(dict1)
#s.index=['q','r','s','t']

s

a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
s5 = pd.Series([1, 2, 3,8,87,78,90,23,14], index=[10, 11, 12,13,14,15,16,17,18])
s5.ix[17]

In [ ]:
s5.ix[[17,13,10]]

# Data Frames

In [74]:
result = DataFrame({'Midterm': [32,76,98,99,67],'Finals':[45,56,76,87,89]})
result

   Midterm  Finals
0       32      45
1       76      56
2       98      76
3       99      87
4       67      89

In [76]:
result['Midterm']

0    32
1    76
2    98
3    99
4    67
Name: Midterm, dtype: int64

In [77]:
result["Finals"]

0    45
1    56
2    76
3    87
4    89
Name: Finals, dtype: int64

In [89]:
result[(result.Midterm<70) & (result.Midterm>40)][['Midterm']]

   Midterm
4       67

# Reading CSV file

In [93]:
df  = pd.read_csv('test.csv', parse_dates=['date'])

In [94]:
df

        date         0         1         2
0 2000-01-01  1.103763 -1.909979 -0.808956
1 2000-01-02  1.188917  0.581120  0.861597
2 2000-01-03 -0.964200  0.779764  1.829062
3 2000-01-04  0.782130 -1.720670 -1.108242
4 2000-01-05 -1.867017 -0.528368 -2.488309
5 2000-01-06  2.569280 -0.471901 -0.835033
6 2000-01-07 -0.399323 -0.676427 -0.011256
7 2000-01-08  1.642993  1.013420  1.435667
8 2000-01-09  1.147308  2.138000  0.554171
9 2000-01-10  0.933766  1.387155 -0.560143

In [95]:
df['date']

0   2000-01-01
1   2000-01-02
2   2000-01-03
3   2000-01-04
4   2000-01-05
5   2000-01-06
6   2000-01-07
7   2000-01-08
8   2000-01-09
9   2000-01-10
Name: date, dtype: datetime64[ns]

In [96]:
df.columns

Index(['date', '0', '1', '2'], dtype='object')

In [97]:
df.date

0   2000-01-01
1   2000-01-02
2   2000-01-03
3   2000-01-04
4   2000-01-05
5   2000-01-06
6   2000-01-07
7   2000-01-08
8   2000-01-09
9   2000-01-10
Name: date, dtype: datetime64[ns]

In [99]:
df["newCol"]=df['1']-df['2']

In [100]:
df

        date         0         1         2    newCol
0 2000-01-01  1.103763 -1.909979 -0.808956 -1.101023
1 2000-01-02  1.188917  0.581120  0.861597 -0.280478
2 2000-01-03 -0.964200  0.779764  1.829062 -1.049298
3 2000-01-04  0.782130 -1.720670 -1.108242 -0.612428
4 2000-01-05 -1.867017 -0.528368 -2.488309  1.959941
5 2000-01-06  2.569280 -0.471901 -0.835033  0.363132
6 2000-01-07 -0.399323 -0.676427 -0.011256 -0.665171
7 2000-01-08  1.642993  1.013420  1.435667 -0.422247
8 2000-01-09  1.147308  2.138000  0.554171  1.583828
9 2000-01-10  0.933766  1.387155 -0.560143  1.947298